# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [5]:
s1 = pd.Series(np.random.randint(1,5,100, dtype='l'))
s2 = pd.Series(np.random.randint(1,4,100, dtype='l'))
s3 = pd.Series(np.random.randint(10000,30001,100, dtype='l'))
print(s1)
print(s2)
print(s3)

0     3
1     3
2     3
3     2
4     4
     ..
95    2
96    1
97    2
98    1
99    1
Length: 100, dtype: int32
0     2
1     3
2     2
3     2
4     1
     ..
95    2
96    2
97    3
98    1
99    2
Length: 100, dtype: int32
0     11750
1     12864
2     25238
3     19685
4     13977
      ...
95    14442
96    23318
97    20938
98    12613
99    18018
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [6]:
housing_market = pd.concat([s1,s2,s3], axis=1)
housing_market.head()

   0  1      2
0  3  2  11750
1  3  3  12864
2  3  2  25238
3  2  2  19685
4  4  1  13977

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [7]:
housing_market.rename(columns = {0: 'bedrs', 1:'bathrs', 2:'price_sqr_meter'}, inplace=True)
housing_market.head()

   bedrs  bathrs  price_sqr_meter
0      3       2            11750
1      3       3            12864
2      3       2            25238
3      2       2            19685
4      4       1            13977

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [8]:
bigcolumn = pd.concat([s1,s2,s3], axis=0)
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))
print(bigcolumn)

<class 'pandas.core.frame.DataFrame'>
        0
0       3
1       3
2       3
3       2
4       4
..    ...
95  14442
96  23318
97  20938
98  12613
99  18018

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [9]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [10]:
bigcolumn.reset_index(drop=True, inplace= True)
bigcolumn

         0
0        3
1        3
2        3
3        2
4        4
..     ...
295  14442
296  23318
297  20938
298  12613
299  18018

[300 rows x 1 columns]